INSERT INTO `orders` (`id`, `address`)
VALUES
	(1, '서울 관악구 xxxx...'),
	(2, '서울 관악구 xxxx...'),
	(3, '서울 관악구 xxxx...'),
	(4, '서울 관악구 xxxx...');


INSERT INTO `orders` (`address`)
VALUES
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...'),
	('서울 관악구 xxxx...');

INSERT INTO `product` (`id`, `name`, `order_id`)
VALUES
	(1, '양말', 1),
	(2, '양말', 1),
	(3, '양말', 1),
	(4, '양말', 1);


INSERT INTO `coupon` (`id`, `discount`, `order_id`)
VALUES
	(1, 2000, 1),
	(2, 1000, 1);

